Tekla.Structures.Model.PolymeshObjectBase
This class is an abstract class for model objects that have surfaces (polymeshes) as their geometries.

Tekla.Structures.Model.PolymeshObjectBase.Insert
Inserts a new model object. The geometry of the object
needs to be set by using the public Polymesh
function, before calling insert.
Returns: True on success.

Tekla.Structures.Model.PolymeshObjectBase.Select
Selects the model object from the model by the identifier of this instance.
Returns: True on success.

Tekla.Structures.Model.PolymeshObjectBase.Modify
Modifies the existing model object in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.PolymeshObjectBase.Delete
Deletes the model object from the model database.
Returns: True on success.

Tekla.Structures.Model.PolymeshObjectBase.CreateInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of creating this object in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PolymeshObjectBase.SelectInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of selecting this object in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PolymeshObjectBase.ModifyInstanceDelegate(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Invokes the delegate of modifying this object in the model.
Returns:
The error code returned from the delegate.

Tekla.Structures.Model.PolymeshObjectBase.ToStruct(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
converts this instance to a struct.
output:
The output parameter.

Tekla.Structures.Model.PolymeshObjectBase.FromStruct(Tekla.Structures.ModelInternal.dotPolymeshObject_t@)
Sets the properties of this instance from the struct.
input:
The input parameter.

Tekla.Structures.Model.PolymeshObjectBase.Polymesh
Gets or sets the polymesh that forms the object geometry.

Tekla.Structures.Model.PolymeshObjectBase.ModelObjectType
Gets the model object type of this instance.